# Практика #1
## Напишите программу, которая просит ввести имя и выводит на консоль строку "Привет, <введенное имя>". 

```
Scanner scan = new Scanner(System.in); // Создаем объект Scanner для считывания ввода пользователя
        System.out.print("Enter name: "); // Выводим приглашение ввести имя
        String name = scan.next(); // Считываем строку, введенную пользователем, и сохраняем в переменную name

        System.out.printf("Привет, %s \n", name); // Форматированно выводим приветствие с введенным именем
        scan.close(); // Закрываем Scanner, освобождая ресурсы
```